clear
format compact

h = 0.005;

Tf1 = 0.05;
Tf2 = 0.05;

% =============================================
g  = 9.81e+00;
L1 = 1.02e-01;  % 10.2cm

% speed mode ---> P: 2, I: 0, D: 850
% 最小二乗法：振子固定
alpha1 = 2.42e-01;
mu1    = 9.67e-01;
delta1 = 1.51e+00;

% 最小二乗法
alpha2 = 1.17e-01;
mu2    = 4.24e-02;

% --------------------------
E = [ 1  0      0  0
      0  alpha1 0  0
      0  0      1  0
      0  L1     0  alpha2 ];
F = [ 0  1      0   0
      0 -mu1    0   0
      0  0      0   1
      0  0      g  -mu2 ];
G = [ 0
      1
      0
      0 ];

% =============================================
A = inv(E)*F;
B = inv(E)*G;

C = [ 1  0  0  0 ];

Ae = [ A  zeros(4,1)
      -C  0 ];
Be = [ B
       0 ];

q1 = 0;
q2 = 0;
q3 = 10000;
q4 = 0;
qs = 1000;

Qe = diag([q1 q2 q3 q4 qs]);
Re = 1;

Ke = -lqr(Ae,Be,Qe,Re);

K = Ke(1:4)
G = Ke(5)

disp('***** Ae + Be*Ke の固有値 *****')
eig(Ae + Be*Ke)
